# Напишите программу, которая считает произведение двух чисел. Программа должна запрашивать оба этих числа у пользователя. Рассчитайте произведение и выведите в консоль:
# второго и второго числа,
# второго и первого числа,
# первого и первого числа.

a = int(input("Enter first number (a): "))
b = int(input("Enter second number (b): "))

print("b * b =", b * b)
print("b * a =", b * a)
print("a * a =", a * a)