# Написать программу, которая выводит на экран фразу "Я изучаю программирование!".
print("Я изучаю программирование!")

# Написать программу, которая выводит на экран результат сложения чисел 10 и 20.
print(10 + 20)

# *** (задание повышенной сложности, необязательное, только для желающих). Написать программу, которая выводит на экран строку - "Привет! Меня зовут Вася и мне 25 лет." Но только имя и возраст программа должна запросить у Вас и подставить в строку.
print("Привет! Меня зовут " + input("Введите Ваше имя: ") + " и мне " + input("Введите Ваш возраст: ") + " лет.")