# Напишите программу, которая выводит на экран числа от 10 до 19.

print("=== for ===")

for i in range(10, 20):
    print(i)


print("\n=== while ===")

i = 10
while i < 20:
    print(i)
    i += 1