# Есть список чисел - [15, 8, 94, 3, 10, 45, 1]
# Напишите программу, которая определяет минимальное значение
# из списка и выводит его в консоль, пользуясь встроенными функциями

numbers = [15, 8, 94, 3, 10, 45, 1]

numbers.sort()

print(numbers[0])