# Дан список чисел - [8, 4, 8, 3, 2, 5]
# Напишите программу, которая выводит все значения списка
# на экран, каждое значение с новой строки

numbers = [8, 4, 8, 3, 2, 5, 65, 5, 89, 100]

for number in numbers:
    print(number)