# Создайте список, который содержит несколько названий фруктов.
# Выведите его на экран так, чтобы каждое название выводилось с новой строки.

fruits = ["Apple", "Orange", "Banana"]

for fruit in fruits:
    print(fruit)