# Вывести на экран фразу, что кот большой и ленивый,
# но только в том случае, если это действительно так
# Предположим, что кот большой, если он весит более 5кг

cat_weight = 6
is_cat_lazy = True

if cat_weight > 5 and is_cat_lazy:
    print("Кот большой и ленивый")